BasicOpenFOAMProgrammingTutorials/OFtutorial05_basicParallelComputing/testCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* numberOfSubdomains 4;
method hierarchical;
hierarchicalCoeffs
{
    n               (4 1 1);
    delta 0.0001;
    order           xyz;
} */

numberOfSubdomains 4;

method          simple;

coeffs
{
    n           (2 2 1);
}

// ************************************************************************* //
